#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

### Regular Plugins
https://github.com/peterhurford/up.zsh
rummik/zsh-tailf
mattmc3/zman
agkozak/zsh-z

### Local Plugins
$ZDOTDIR/.aliases
$ZDOTDIR/custom/plugins/poetry
$ZDOTDIR/custom/plugins/tmux
$ZDOTDIR/custom/plugins/export-zsh.plugin.zsh

### Prompts
romkatv/powerlevel10k

### Utilities
romkatv/zsh-bench kind:path

### Framework: Oh-My-Zsh
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/gpg-agent

### Framework: zsh-utils
belak/zsh-utils path:history
belak/zsh-utils path:utility
belak/zsh-utils path:editor

# Syntax highlighting
zdharma-continuum/fast-syntax-highlighting

### Completions
zsh-users/zsh-completions path:src kind:fpath

# Compinit plugin
belak/zsh-utils path:completion

### Final Plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
